Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: But when this has taken place, then that which was said in the Writings will come true, Death is overcome by life.
chr: ᎾᏍᎩᏃ ᎿᏉ ᎯᎠ ᎠᏲᎩ ᎨᏒ ᎠᏲᎩ ᏂᎨᏒᎾ ᎨᏒ ᎤᏄᏬᏍᏔᏁᏍᏗ, ᎠᎴ ᎯᎠ ᎾᏍᎩ ᎠᏲᎱᏍᎩ ᎠᏲᎱᏍᎩ ᏂᎨᏒᎾ ᎨᏒ ᎤᏄᏬᏍᏔᏁᏍᏗ, ᎿᏉ ᏄᎵᏍᏔᏁᏍᏗ ᎯᎠ ᎢᎦᏪᏛ ᎨᏒ ᏥᎪᏪᎳ, ᎠᏓᎵᏁᎯᏗᏍᎩ ᎨᏒ ᎤᎩᏐᏅ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ.

source: O death, where is your power? O death, where are your pains?
chr: ᏂᎯ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎭᏢ ᏣᏓᏨᏯᏍᏗᎨᏒᎢ? ᏂᎯ ᏗᏓᏂᏐᏗᏱ ᎨᏒᎢ, ᎭᏢ ᏣᏓᏎᎪᎩᏍᏗ ᎨᏒᎢ?

source: The pain of death is sin; and the power of sin is the law:
chr: ᎠᏲᎱᏍᏗ ᎤᏓᏨᏯᏍᏗ ᎨᏒ, ᎾᏍᎩ ᎠᏍᎦᏂ; ᎠᏍᎦᏂᏃ ᎤᎵᏂᎪᎯᏍᏗᏍᎩ ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ.

source: But praise be to God who gives us strength to overcome through our Lord Jesus Christ.
chr: ᎠᏎᏃ ᎤᏁᎳᏅᎯ ᎠᎵᎮᎵᏤᏗ ᎨᏎᏍᏗ, ᎾᏍᎩ ᏥᎩᏁᎭ ᎢᎦᏓᏎᎪᎩᏍᏗᏱ, ᏨᏗᏓᎴᎲᏍᎦ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᏥᏌ ᎦᎶᏁᏛ.

source: For this cause, my dear brothers, be strong in purpose and unmoved, ever giving yourselves to the work of the Lord, because you are certain that your work is not without effect in the Lord.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏨᎨᏳᎢ ᎢᏓᎵᏅᏟ, ᏗᏣᎵᏂᎩᏗᏳ ᎨᏎᏍᏗ, ᎦᏰᏥᏖᎸᏗ ᏂᎨᏒᎾ ᎨᏎᏍᏗ, ᏂᎪᎯᎸ ᎤᏣᏘ ᏕᏥᎸᏫᏍᏓᏁᎮᏍᏗ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ, ᎢᏥᎦᏔᎭᏰᏃ ᎾᏍᎩ ᎢᏣᎵᏂᎬᏁᎲ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᏕᏥᎸᏫᏍᏓᏁᎲ ᎠᏎᏉᏉ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: Now about the giving of money for the saints, as I gave orders to the churches of Galatia, so do you.
chr: ᎾᏃ ᎦᏟᏐᏗ ᎨᏒ ᎤᎾᏓᏅᏘ ᎤᎾᎵᏍᏕᎸᏙᏗ ᎤᎬᏩᎵ, ᎾᏍᎩᏯ ᏥᎦᏥᏁᏤᎸᎢ ᏧᎾᏁᎶᏗ ᏚᎾᏓᏡᎬ ᎨᎴᏏᏱ, ᎾᏍᎩᏯ ᏂᏣᏛᏁᎮᏍᏗ.

source: On the first day of the week, let every one of you put by him in store, in measure as he has done well in business, so that it may not be necessary to get money together when I come.
chr: ᎢᎬᏱᏱ ᎢᎦ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒ ᎢᏥᏏᏴᏫᎭ ᎢᏣᏓᏁᎸᏍᎨᏍᏗ ᎾᏍᎩᏯ ᏄᏍᏛ ᎤᏁᎳᏅᎯ ᎢᏥᏁᏉᎡᎸᎢ, ᎾᏍᎩᏃ ᏞᏍᏗ ᏫᏥᎷᏨᎭ ᎩᎳ ᏫᎦᏟᏐᏗ ᏱᎨᏎᏍᏗ.

source: And when I come, I will send the men of your selection with letters to take the money you have got together to Jerusalem.
chr: ᏫᏥᎷᏨᏃ ᎾᏍᎩ Ꮎ ᎣᏏᏳ ᏗᏥᏰᎸᏅᎯ, ᎾᏍᎩ ᏗᎦᏥᏯᎨᏅᏗᏍᏗ ᎨᏎᏍᏗ ᎪᏪᎵ, ᎾᏍᎩ ᎠᏂᏰᎩ ᏥᎷᏏᎵᎻ ᏂᎯ ᎢᏣᎵᏍᎪᎸᏔᏅᎯ.

source: And if it is possible for me to go there, they will go with me.
chr: ᎢᏳ ᎠᎴ ᏚᏳᎪᏕᏍᏗ ᎾᏍᏉ ᎠᏴ ᎠᏇᏅᏍᏗᏱ, ᎾᏍᎩ ᏓᏲᏤᏅᏍᏔᏂ.

source: But I will come to you after I have gone through Macedonia, for that is my purpose;
chr: ᎠᎴ ᏮᏓᏨᎷᏤᎵ, ᎹᏏᏙᏂ ᎠᏰᎵ ᎠᎩᎶᏒᎯ ᎨᏎᏍᏗ; ᎹᏏᏙᏂᏰᏃ ᎠᏰᎵ ᎠᎩᎶᎯᏍᏗᏱ ᏂᎦᎵᏍᏗᎭ.

source: But I may be with you for a time, or even for the winter, so that you may see me on my way, wherever I go.
chr: ᎠᎴ ᏫᎬᏆᏕᏗ ᏱᏂᎦᎩ, ᎠᎴ ᎾᏍᏉ ᏯᏆᎪᎳᏗᏴ ᎢᏤᎲᎢ, ᎾᏍᎩ ᏍᎩᏯᏘᏅᏍᏗᏱ ᎦᎢᏒ ᎢᎸᎯᏢ ᏫᏥᎦᏛᎢ.

source: For it is not my desire to see you now, on my way; because it is my hope to be with you for some time, if that is the Lord's pleasure.
chr: ᎥᏝᏰᏃ ᏯᏆᏚᎵ ᎪᎯ ᎨᏒ ᎦᎢᏒ ᎢᏨᎪᏩᏛᏗᏱ; ᎠᏎᏃ ᎤᏚᎩ ᎠᏋᎭ ᎢᎸᏍᎩ ᎢᎪᎯᏛ ᎢᏨᏯᏕᏁᏗᏱ, ᎢᏳᏃ ᎤᎬᏫᏳᎯ ᎣᏏᏳ ᏳᏰᎸᏅ.

source: But I will be at Ephesus till Pentecost;
chr: ᎡᏈᏌᏍᎩᏂ ᎨᏙᎮᏍᏗ ᎯᏍᎦᏍᎪᎯᏁ ᎢᎦ ᎢᏯᏍᏗ.

source: For a great and important door there is open to me, and there are a number of people against me.
chr: ᎡᏉᎯᏳᏰᏃ ᎥᎩᎳᏅᏓᏕᎸ ᎠᎴ ᎤᏣᏘ ᎪᎱᏍᏗ ᎦᎬᏙᏗ, ᎠᎴ ᎤᏂᏣᏔ ᏗᏂᎦᏘᎴᎩ.

source: Now if Timothy comes, see that he is with you without fear; because he is doing the Lord's work, even as I am:
chr: ᎢᏳᏃ ᏗᎹᏗ ᏫᎦᎷᏨᎭ, ᎢᏣᎦᏌᏯᏍᏕᏍᏗ ᏂᎦᎾᏰᏍᎬᎾᏉ ᎢᏤᎳᏗᏓᏍᏗᏱ; ᏚᎸᏫᏍᏓᏁᏰᏃ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ, ᎤᏠᏱᏉ ᎠᏴ.

source: See then that he has the honour which is right. But send him on his way in peace, so that he may come to me: for I am looking for him with the brothers.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏞᏍᏗ ᎩᎶ ᏳᏂᏆᏘᎮᏍᏗ; ᏅᏩᏙᎯᏯᏛᏉᏍᎩᏂ ᏤᏣᏂᎩᏍᏔᏅᎭ, ᎾᏍᎩ ᎠᏴ ᎠᎩᎷᏤᏗᏱ; ᏥᎦᏖᏃᎭᏰᏃ ᎤᎷᎯᏍᏗᏱ ᎠᎾᎵᏅᏟ ᎠᏂᎷᏨᎭ.

source: But as for Apollos, the brother, I had a great desire for him to come to you with the brothers, but it was not his pleasure to come now; but he will come when he has a chance.
chr: ᎠᏃ ᎠᏉᎳ ᎢᎩᏅᏟ, ᎤᏣᏘ ᏥᏍᏗᏰᏓ ᏫᏥᎷᏤᏗᏱ ᎤᏁᏅᏍᏙᏗᏱ ᎠᎾᎵᏅᏟ; ᎠᏎᏃ ᎥᏝ ᏳᏚᎸ ᎠᏎ ᎪᎯ ᎨᏒ ᎤᏪᏅᏍᏗᏱ; ᏮᏓᎦᎷᏥ ᎠᏗᎾ ᎤᏜᏅᏓᏕᎸᎭ.

source: Be on the watch, unmoved in the faith, and be strong like men.
chr: ᎢᏥᏯᏫᏍᎨᏍᏗ, ᎤᎵᏂᎩᏛ ᏕᏥᏂᏴᏎᏍᏗ ᎪᎯᏳᏗ ᎨᏒᎢ, ᎢᏥᏍᎦᏯ ᎨᏎᏍᏗ, ᏗᏣᎵᏂᎩᏗᏳ ᎨᏎᏍᏗ.

source: Let all you do be done in love.
chr: ᏂᎦᏛ ᏕᏥᎸᏫᏍᏓᏁᎲ ᎠᏓᎨᏳᏗ ᎨᏒ ᎢᏨᏗᏍᎨᏍᏗ.

source: Now I make my request to you, my brothers, for you have knowledge that the house of Stephanas is the first-fruits of Achaia, and that they have made themselves the servants of the saints,
chr: ᎠᎴᏬ ᎢᏓᎵᏅᏟ, ᏕᏥᎦᏔᎭ ᏍᏗᏇᎾ ᏚᏓᏘᎾᎥᎢ, ᎾᏍᎩ ᎢᎬᏱ ᎤᏓᏔᏅᎯ ᎨᏒ ᎠᎦᏯ, ᎠᎴ ᎾᏍᎩ ᏚᎾᏓᏲᏒ ᏧᏂᏍᏕᎸᎯᏓᏍᏗᏱ ᎤᎾᏓᏅᏘ;

source: That you put yourselves under such, and under everyone who is helping the Lord's work.
chr: ᎢᏨᏔᏲᏎᎭ ᏂᎯ ᏗᏦᎯᏳᏗᏱ ᎾᏍᎩ ᎢᏳᎾᏍᏗ, ᎠᎴ ᎾᏂᎥ ᎢᏧᎳᎭ ᏧᏂᎸᏫᏍᏓᏁᎯ ᎠᎾᎵᏂᎬᏁᎯ.

source: And I am glad of the coming of Stephanas and Fortunatus and Achaicus: for they have done what was needed to make your work complete.
chr: ᎦᎵᎡᎵᎦ ᎬᎩᎷᏤᎸ ᏍᏗᏇᎾ ᎠᎴ ᏉᏚᏁᏓ ᎠᎴ ᎠᎦᏱᎦ; ᏂᎯᏰᏃ ᏥᏥᎷᎶᏤᎲᎩ ᎠᏂᎧᎵᏏᏌ ᎾᏍᎩ.

source: For they gave comfort to my spirit and to yours: for which cause give respect to such people.
chr: ᎠᏂᎦᎵᏍᏓᏓᏰᏃ ᎠᏆᏓᏅᏙ, ᎠᎴ ᏂᎯ ᏗᏣᏓᏅᏙ. ᎾᏍᎩ ᎢᏳᏍᏗ ᏕᏥᎸᏉᏕᏍᏗᏉ ᎾᏍᎩ ᎢᏳᎾᏍᏗ.

source: The churches of Asia send their love to you. So do Aquila and Prisca, with the church which is in their house.
chr: ᏧᎾᏁᎶᏗ ᏚᎾᏓᏡᏩᏗᏒ ᎡᏏᏱ ᏫᎨᏥᏲᎵᎭ. ᎡᏈᎳ ᎠᎴ ᏈᏏᎳ ᎤᏣᏘ ᏫᎨᏥᏲᎵᎭ ᎤᎬᏫᏳᎯ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏲᎵᏍᏗ ᎨᏒᎢ, ᎬᏩᎾᎵᎪᏁᎭ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᎾᏍᎩ ᎠᏂᏁᎸᎢ.

source: All the brothers send their love to you. Give one another a holy kiss.
chr: ᏂᎦᏛ ᎢᏓᎵᏅᏟ ᏫᎨᏥᏲᎵᎭ. ᏕᏣᏓᏲᎵᏍᏗᏍᎨᏍᏗ ᎦᎸᏉᏗᏳ ᏗᏓᏙᏪᏙᎥᏍᏗ ᎨᏒᎢ.

source: I, Paul, send you these words of love in my writing.
chr: ᎠᏴ ᏉᎳ ᎠᏆᏓᏲᎵᏍᏗ ᎨᏒ ᎠᏋᏒ ᎠᏉᏰᏂ ᎠᏋᏔᏅᎯ ᎠᏉᏪᎳᏅᎯ.

source: If any man has not love for the Lord, let him be cursed. Maran atha (our Lord comes).
chr: ᎢᏳᏃ ᎩᎶ ᏄᎨᏳᏒᎾ ᎢᎨᏎᏍᏗ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ, ᎾᏍᎩ ᎠᏥᏍᎩᏅᏛᎯ ᎨᏎᏍᏗ. ᎤᎬᏫᏳᎯ ᏓᎦᎷᏥ.

source: The grace of our Lord Jesus Christ be with you.
chr: ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ ᏕᏥᎧᎿᏩᏗᏙᎮᏍᏗ.

source: My love be with you all in Christ Jesus. So be it.
chr: ᎠᏴ ᎠᏆᏓᎨᏳᏗ ᎨᏒ ᏕᏥᎧᎿᏩᏗᏙᎮᏍᏗ ᏂᏥᎥᎢ, ᏥᏌ ᎦᎶᏁᏛ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ. ᎡᎺᏅ.

source: Second Epistle to the Corinthians
chr: ᎪᎵᏂᏗᏱ ᎠᏁᎯ ᏔᎵᏁ ᎨᎪᏪᎳᏁᎸᎯ

source: Paul, an Apostle of Jesus Christ by the purpose of God, and Timothy the brother, to the church of God which is in Corinth, with all the saints who are in all Achaia:
chr: ᏉᎳ, ᏥᏌ ᎦᎶᏁᏛ ᎠᎩᏅᏏᏛ ᎾᏍᎩᏯ ᎤᏁᎳᏅᎯ ᎤᏓᏅᏖᎸᎢ, ᎠᎴ ᏗᎹᏗ ᎢᎩᏅᏟ, ᏫᏨᏲᏪᎳᏏ ᏗᏣᏁᎶᏗ ᎢᏣᏓᏡᎬ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎪᎵᏂᏗᏱ ᏥᏣᏓᏡᎬ, ᎠᎴ ᏂᎦᏛ ᎢᏣᏓᏅᏘ ᏂᎬᎾᏛ ᎠᎦᏯ ᎢᏤᎲᎢ;

source: Praise be to the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all comfort;
chr: ᎦᎸᏉᏙᏗ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᎤᏙᏓ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᏥᏌ ᎦᎶᏁᏛ, ᎤᏓᏙᎵᏣᏘ ᎠᎦᏴᎵᎨᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏂᎦᎥ ᎠᏓᎦᎵᏍᏓᏗᏍᎩ;

source: Who gives us comfort in all our troubles, so that we may be able to give comfort to others who are in trouble, through the comfort with which we ourselves are comforted by God.
chr: ᎾᏍᎩ ᎣᎩᎦᎵᏍᏓᏗᏍᎩ ᏥᎩ ᏂᎦᎥ ᏧᏓᎴᏅᏛ ᎣᏥᎩᎵᏲᎬᎢ, ᎾᏍᎩ ᎢᏳᏩᏂᏐᏗᏱ ᏰᎵ ᏗᎦᏲᏥᎦᎵᏍᏓᏗᏍᏗ ᎠᏂᎩᎵᏲᎩ, ᎦᏲᎬᏙᏗ ᎾᏍᎩ ᎠᏓᎦᎵᏍᏓᏗᏍᎩ ᎣᎬᏒ ᎣᎩᎦᎵᏍᏓᏗᏍᏗᏍᎬ ᎤᏁᎳᏅᎯ.

source: For as we undergo more of the pain which Christ underwent, so through Christ does our comfort become greater.
chr: ᎾᏍᎩᏯᏰᏃ ᎦᎶᏁᏛ ᎤᎩᎵᏲᏨ ᎤᏣᏘ ᏦᏥᎩᎵᏲᎦ, ᎾᏍᎩᏯ ᎾᏍᏉ ᎤᏣᏔ ᎣᎩᏁᎭ ᎠᏓᎦᎵᏍᏓᏗᏍᎩ ᎦᎶᏁᏛ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ.

source: But if we are troubled, it is for your comfort and salvation; or if we are comforted, it is for your comfort, which takes effect through your quiet undergoing of the same troubles which we undergo:
chr: ᎢᏳ ᎠᎴ ᎾᏍᏉ ᏲᏥᎩᎵᏲᎦ, ᎢᏥᎦᎵᏍᏓᏗᏍᏗ ᎠᎴ ᎢᏣᎵᏍᏕᎸᏙᏗ ᎤᎬᏩᎳ, ᎾᏍᎩ ᏥᏥᏩᏛᎡᎭ ᏗᏨᏂᏗᏳ ᎢᏥᎩᎵᏲᎢᏍᏗᏱ ᎠᏴ ᎣᏥᎩᎵᏲᎬ ᎤᏠᏱ; ᎢᏳ ᎠᎴ ᎤᎦᎵᏍᏗ ᏲᎦᏓᏅᏔ, ᎢᏥᎦᎵᏍᏓᏗᏍᏗ ᎠᎴ ᎢᏣᎵᏍᏕᎸᏙᏗ ᎤᎬᏩᎳ.

source: And our hope for you is certain; in the knowledge that as you take part in the troubles, so you will take part in the comfort.
chr: ᎠᎴ ᎤᏚᎩ ᎢᏨᏴᏒ ᎤᎵᏂᎩᏗᏳ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᏦᏥᎦᏔᎭ, ᎾᏍᎩ ᎢᏣᏠᏯᏍᏗᏍᎬ ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒᎢ, ᎾᏍᎩᏯ ᎾᏍᏉ ᎢᏣᏠᏯᏍᏙᏗ ᎨᏎᏍᏗ ᎤᎦᎵᏍᏗ ᎨᏒᎢ.

source: For it is our desire that you may not be without knowledge of our trouble which came on us in Asia, that the weight of it was very great, more than our power, so that it seemed that we had no hope even of life:
chr: ᎥᏝᏰᏃ ᏲᎦᏚᎵᎭ, ᎢᏓᎵᏅᎵ, ᏂᏥᎦᏔᎲᎾᏉ ᎢᏳᎵᏍᏙᏗᏱ ᎾᏍᎩ ᎤᏕᏯᏙᏗ ᎣᎩᎷᏤᎸ ᎡᏏᏱ, ᎾᏍᎩ ᎤᎶᏒᏍᏔᏅᎯ ᎦᎨᏛ ᎣᎩᎷᏤᎸᎢ, ᎤᎶᏒᏍᏔᏅᎯ ᏂᏙᎦᎵᏂᎬᎬᎢ, ᎾᏍᎩᏃ ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎣᎦᎸᏲᎵᎸᎩ ᏦᎦᏛᏂᏗᏍᏗᏱ;

source: Yes, we ourselves have had the answer of death in ourselves, so that our hope might not be in ourselves, but in God who is able to give life to the dead:
chr: ᎠᏎᏃ ᎣᎩᎲᎩ ᏦᎩᏲᎱᎯᏍᏗᏱ ᏚᏚᎪᏔᏅᎢ, ᎾᏍᎩ ᏱᎬᏒᏉ ᎣᎦᏓᎵᏍᎦᏍᏙᏗᏱ ᏂᎨᏒᎾ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎣᏣᎵᏍᎦᏍᏙᏗᏱ, ᎾᏍᎩ Ꮎ ᏧᏂᏲᎱᏒᎯ ᏗᎴᎯᏐᏗᏍᎩ;

source: Who gave us salvation from so great a death: on whom we have put our hope that he will still go on to give us salvation;
chr: ᎾᏍᎩ Ꮎ ᎣᎫᏓᎴᏛ ᎾᏍᎩ ᎢᏳᎾᏰᎯᏍᏗ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎠᏏ ᏦᎫᏓᎴᎭ; ᎾᏍᎩ ᎤᏚᎩ ᏦᏨᎾᏁᎭ ᎠᏏᏉ ᎣᎫᏓᎴᏍᏗᏱ;

source: You at the same time helping together by your prayer for us; so that for what has been given to us through a number of persons, praise may go up to God for us from all of them.
chr: ᏂᎯ ᎾᏍᏉ ᏍᎩᏍᏕᎵᏍᎬ ᎢᏣᏓᏙᎵᏍᏗᏍᎬ ᎣᎩᏍᏕᎸᏗᏱ, ᎾᏍᎩ ᎣᎩᏙᎵᏨ ᎤᏂᏣᏘ ᎢᏳᏅᏂᏌᏛ ᏅᏓᏳᎵᏍᏙᏗᏱ ᎤᏂᏣᏘ ᎤᎾᎵᎮᎵᏤᏗᏱ [ᎤᏁᎳᏅᎯ] ᎠᏴ ᎨᏒ ᎢᏳᏍᏗ.

source: For our glory is in this, in the knowledge which we have that our way of life in the world, and most of all in relation to you, has been holy and true in the eyes of God; not in the wisdom of the flesh, but in the grace of God.
chr: ᎯᎠᏰᏃ ᏅᏗᎦᎵᏍᏙᏗᎭ ᏦᏣᎵᎮᎵᎦ, ᎾᏍᎩ ᏦᎦᏓᏅᏙᎩ ᎪᎯᏳᏗᏍᎬᎢ, ᏃᏨᏗᏍᎬᎾ ᎤᏇᏓᎵᏉ ᎤᎬᏩᎵ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒᎢ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎣᎩᏍᏕᎵᏍᎬᎢ, ᏄᏠᎾᏍᏛᎾ ᎨᏒ ᎣᏨᏗᏍᎬ ᎣᎨᏙᎸ ᎠᏂ ᎡᎶᎯ ᎨᏒᎢ; ᎠᎴ Ꮀ ᎤᎬᏫᏳᎭ ᏂᎯ ᎢᏤᎲᎢ.

source: For in our letters we say no other things to you, but those which you are reading, and to which you give agreement, and, it is my hope, will go on doing so to the end:
chr: ᎥᏝᏰᏃ ᏅᏩᏓᎴ ᎪᎱᏍᏗ ᏱᏨᏲᏪᎳᏁᎭ, ᎾᏍᎩ Ꮎ ᎤᏩᏒ ᏥᏥᎦᏔᎭ ᎠᎴ ᎾᏍᏉ ᏥᏕᏣᏓᏂᎸᏨ; ᎠᎴ ᎤᏚᎩ ᎠᏋᎭ ᎬᎵᏍᏆᏗᏍᎩ ᏗᏣᏓᏂᎸᎢᏍᏗᏱ ᎨᏒᎢ;

source: Even as you have been ready, in part, to say that we are your glory, in the same way that you are ours, in the day of the Lord Jesus.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᏰᎵᎦᎾᎨ ᏗᏍᎩᏯᏓᏂᎸᏨᎯ ᏥᎩ, ᎾᏍᎩ ᎠᏴ ᎨᏒ ᎢᏨᏯᎵᎡᎵᏍᏗᏍᎬᎢ, ᎾᏍᎩᏯ ᏍᎩᏯᎵᎡᎵᏍᏙᏗ ᏥᎩ, ᎾᎯᏳ ᎤᎬᏫᏳᎯ ᏥᏌ ᎤᏤᎵ ᎢᎦ ᎨᏎᏍᏗ.

source: And being certain of this, it was my purpose to come to you before, so that you might have a second grace;
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᏍᏛ ᎠᏉᎯᏳᏒ ᎠᏆᏓᏅᏖᎸᎩ ᎪᎯ ᎨᏒ ᎠᏏ ᎾᏍᏆᎵᏍᎬᎾ ᏫᏨᎷᏤᏗᏱ, ᎾᏍᎩ ᎢᏳᏩᏂᏐᏗᏱ ᏔᎵᏁ ᎣᏍᏛ ᎢᏣᏓᏅᏓᏗᏍᏗᏱ;

source: And by way of Corinth to go into Macedonia, and from there to come back again to you, so that you might send me on my way to Judaea.
chr: ᎠᎴ ᏫᏨᎶᎢᏍᏓᏁᏗᏱ ᎹᏏᏙᏂ ᏩᎩᎷᎯᏍᏗᏱ, ᎠᎴ ᎹᏏᏙᏂ ᏗᎦᏂᎩᏒ ᏔᎵᏁ ᏅᏓᏨᎷᏤᏗᏱ, ᎠᎴ ᏧᏗᏱ ᏫᏥᎦᏛ ᏍᎩᏯᏘᏅᏍᏗᏱ.

source: If then I had such a purpose, did I seem to be changing suddenly? or am I guided in my purposes by the flesh, saying, Yes, today, and, No, tomorrow?
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏛ ᏣᏆᏓᏅᏖᎸᎩ, ᏅᎵᏌᎵᏉᏍᎪ ᎠᎩᏰᎸᎯ ᎨᏎᎢ? ᎠᎴ ᎪᎱᏍᏗ ᎦᏓᏅᏛᎵ, ᏥᎪ ᎤᏇᏓᎵ ᎤᏓᏅᏖᏗ ᎦᏓᏖᏍᎪᎢ, ᎾᏍᎩᏃ ᎠᏴ ᏥᏁᎬ ᎯᎠᏉ ᏱᏄᏍᏗ, ᎥᎥ, ᎥᎥ, ᎠᎴ ᎥᏝ, ᎥᏝ?

source: As God is true, our word to you is not Yes and No.
chr: ᎤᏁᎳᏅᎯᏍᎩᏂ ᏄᏓᎵᏓᏍᏛᎾ ᏥᎩ, ᎾᏍᎩ [ᏄᏙᎯᏳᎭ] ᎠᏴ ᎢᏨᏁᏤᎲ ᎥᎥ ᎠᎴ ᎥᏝ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: For the Son of God, Jesus Christ, whom we were preaching among you, even I and Silvanus and Timothy, was not Yes and No, but in him is Yes.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎤᏪᏥ ᏥᏌ ᎦᎶᏁᏛ, ᎾᏍᎩ ᎢᏤᎲ ᎢᏨᏯᎵᏥᏙᏁᎸᎯ ᏥᎩ, ᎾᏍᎩ ᎠᏴ, ᎠᎴ ᏏᎵᏪᎾ, ᎠᎴ ᏗᎹᏗ ᎢᏨᏯᎵᏥᏙᏁᎸᎯ ᏥᎩ, ᎥᎥ ᎠᎴ ᎥᏝ ᎤᏛᏗᏱ ᎥᏝ ᏲᎦᏛᏁᎢ, ᎥᎥᏍᎩᏂ ᎤᏩᏒ ᎤᏛᏗᏱ ᎬᏂᎨᏒ ᏃᎬᏁᎸᎩ.

source: For he is the Yes to all the undertakings of God: and by him all the words of God are made certain and put into effect, to the glory of God through us.
chr: ᎾᎦᏛᏰᏃ ᎤᏚᎢᏍᏔᏅᎢ ᎤᏁᎳᏅᎯ ᎾᏍᎩ Ꮎ ᎢᏳᏩᏂᏌᏛ, ᎥᎥ ᎬᏛᏗ, ᎠᎴ ᎤᏙᎯᏳᎯᏯ ᎨᏐ ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎠᏥᎸᏉᏙᏗᏱ ᎠᏴ ᎢᏲᎬᏁᏗᏱ.

source: Now he who makes our faith strong together with you, in Christ, and has given us of his grace, is God;
chr: ᎾᏍᎩᏃ ᎠᏴ ᎠᎴ ᏂᎯ ᎢᏧᎳᎭ ᏗᎦᎵᏂᎪᎯᏍᏗᏍᎩ ᎦᎶᏁᏛ ᎡᏓᏤᎵᎦ ᎨᏒᎢ, ᎠᎴ ᎢᎩᎶᏁᎥᎯ, ᎾᏍᎩ Ꮎ ᎤᏁᎳᏅᎯ;

source: And it is he who has put his stamp on us, even the Spirit, as the sign in our hearts of the coming glory.
chr: ᎾᏍᎩ Ꮎ ᎾᏍᏉ ᎢᎩᏰᎸᏔᏅᎯ ᏥᎩ, ᎠᎴ ᎢᎩᏁᎸᎯ ᏥᎩ ᏗᎩᎾᏫᏱ ᎠᏓᏅᏙ ᎠᎦᏘᏗᏍᏙᏗ ᎨᏒᎢ.

source: But God is my witness that it was in pity for you that I did not come to Corinth at that time.
chr: ᎠᎴ ᎤᏁᎳᏅᎯ ᏥᏔᏲᏎᎭ ᎠᎦᏔᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏆᏓᏅᏙ ᎤᏬᎯᏳᏓᏁᏗᏱ, ᎾᏍᎩ ᎢᏨᎨᏳᎥᏍᎬ ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᎠᏏ ᎪᎵᏂᏗᏱ ᏫᏂᏥᎷᎬᎾ ᏥᎩ;

source: Not that we have authority over your faith, but we are helpers of your joy: for it is faith which is your support.
chr: ᎥᏝ ᎠᏗᎾ ᎢᏨᏯᏓᏅᏖᎮᎯ ᎨᏒ ᎢᏦᎯᏳᏒᎢ, ᎣᏥᏍᏕᎵᏍᎩᏉᏍᎩᏂ ᎨᏒ ᎢᏣᎵᎮᎵᎬᎢ; ᎢᏦᎯᏳᏒᏰᏃ ᏂᎦᎵᏍᏙᏗ ᎠᏏ ᏥᏕᏥᏙᎦ.

source: But it was my decision for myself, not to come again to you with sorrow.
chr: ᎠᏎᏃ ᎯᎠ ᏄᏍᏛᎩ ᎠᏋᏒ ᎨᏒ ᏓᏊᎪᏔᏅᎩ, ᎾᏍᎩ ᏔᎵᏁ ᏫᏨᎷᏤᏗᏱ ᏂᎨᏒᎾ ᎤᏲ ᎬᏆᏓᏅᏘ.

source: For if I give you sorrow, who then will make me glad, but he who is made sad by me?
chr: ᎢᏳᏰᏃ ᎤᏲ ᏱᏨᏯᏓᏅᏓᏗᏍᏔᏅ, ᎦᎪ ᎣᏍᏛ ᏯᏆᏓᏅᏓᏗᏍᏓ, ᎾᏍᎩᏉ Ꮎ ᎤᏩᏒ ᎤᏲ ᏥᏯᏓᏅᏓᏗᏍᏔᏅᎯ?

source: And I said this very thing in my letter, for fear that when I came I might have sorrow from those from whom it was right for me to have joy; being certain of this, that my joy is the joy of you all.
chr: ᎠᎴ ᎾᏍᎩ ᏥᏄᏍᏛ ᏥᏫᏨᏲᏪᎳᏁᎸᎩ, ᏞᏍᏗᏉ ᎾᎿ ᏫᏥᎷᏨᎭ, ᎤᏲ ᏱᎬᏆᏓᏅᏓᏗᏍᏔᏁᏍᏗ ᎾᏍᎩ Ꮎ ᎤᎵᎮᎵᏍᏗ ᎬᏆᏓᏅᏓᏗᏍᏙᏗ ᏥᎩ, ᎠᏇᎵᏒᎩ; ᏂᏥᎥᏉ ᎢᏨᏲᎢᏳᎭ ᎾᏍᎩ ᏄᏍᏛ ᎠᏆᎵᎮᎵᏍᏗᏍᎬ ᎾᏍᏉ ᎾᏍᎩ ᏂᎯ ᏂᏥᎥ ᎢᏣᎵᎮᎵᏍᏗᏍᎬᎢ.

source: For out of much trouble and pain of heart and much weeping I sent my letter to you; not to give you sorrow, but so that you might see how great is the love which I have to you.
chr: ᎤᏣᏘᏰᏃ ᎠᎩᎵᏯ ᎨᏒ, ᎠᎴ ᎡᎯᏍᏗ ᎠᏆᏓᏅᏔᏩᏕᎬ ᏫᏨᏲᏪᎳᏁᎸᎩ ᎤᏣᏘ ᏗᎦᏥᎦᏌᏬᎢᎯ ᎨᏒᎢ; ᎥᏝ ᎠᏗᎾ ᎤᏲ ᎤᎾᏓᏅᏓᏗᏍᏙᏗ ᎨᏎᏍᏗ ᏯᏇᎵᏎᎢ, ᎢᏥᎦᏙᎥᎯᏍᏗᏱᏉᏍᎩᏂ ᎾᏍᎩ ᎤᏣᏔᏅᎯ ᎢᏨᎨᏳᎢᏳ ᎨᏒᎢ.

source: But if anyone has been a cause of sorrow, he has been so, not to me only, but in some measure to all of you (I say this that I may not be over-hard on you).
chr: ᎢᏳᏍᎩᏂᏃᏅ ᎩᎶ ᎡᎯᏍᏗ ᏧᏓᏅᏓᏗᏍᏔᏅᎯ ᎨᏎᏍᏗ, ᎥᏝ ᎠᏴᏉ ᎡᎯᏍᏗ ᏯᏆᏓᏅᏓᏗᏍᏔᏅ; ᏂᎯᏍᎩᏂ ᏂᏥᎥ ᏰᎵ ᎡᎯᏍᏗ ᎢᏣᏓᏅᏓᏗᏍᏔᏅ; ᎾᏍᎩ ᏥᎶᏒᏍᏓᏁᏗᏱ ᏂᎨᏒᎾ ᏥᎳᏫᏎᎲᎢ.

source: Let it be enough for such a man to have undergone the punishment which the church put on him;
chr: ᎠᎵᏉ ᎾᏍᎩ ᎢᏳᏍᏗ [ᎠᏍᎦᏯ] ᏅᏍᏛᏛᎢ ᎾᏍᎩ ᎤᏂᏣᏘ ᏥᎬᏩᏍᏛᏗᏍᏔᏅ.

source: So that now, on the other hand, it is right for him to have forgiveness and comfort from you, for fear that his sorrow may be over-great.
chr: ᎾᏍᎩᏃ ᎪᎯ ᎨᏒ ᏰᏥᏙᎵᏨᏉ, ᎠᎴ ᏰᏥᎦᎵᏍᏓᏛ, ᏱᏅᏎᎦᎩ ᎾᏍᎩ ᎤᏣᏘ ᎤᏲ ᎤᏰᎸᏒ ᏳᏃᏴᏘᏍᏓ.

source: For which cause my desire is that you will make your love to him clear by your acts.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏨᏔᏲᏎᎭ ᎡᏥᏍᏓᏱᏕᏗᏱ ᎡᏥᎨᏳᎢᏳ ᎨᏒᎢ.

source: And for the same reason I sent you a letter so that I might be certain of your desire to do my orders in all things.
chr: ᎾᏍᎩᏰᏃ ᎯᎠ Ꮀ ᎤᎬᏩᎸᎩ ᏥᏫᏨᏲᏪᎳᏁᎸᎩ, ᎾᏍᎩ ᎢᏨᎪᎵᏰᏍᎬᎩ, ᎾᏍᎩ ᏂᎦᎥ ᏧᏓᎴᏅᏛ ᏂᏨᏪᏎᎲ ᏂᏣᏛᏁᎲ ᎠᎴ ᏂᏣᏛᏁᎲᎾ ᎨᏒᎢ.

source: But if you give forgiveness to anyone, I do the same: for if I have given forgiveness for anything, I have done it because of you, in the person of Christ;
chr: ᎩᎶ ᏰᏥᎥᎡᎸ ᎪᎱᏍᏗ ᎤᏍᎦᏅᏨ, ᎠᏴ ᎾᏍᏉ ᏥᎥᎡᎭ; ᎢᏳᏰᏃ ᎠᏴ ᎪᎱᏍᏗ ᎠᏍᎦᏅᏨᎢ ᏱᏥᎥᏍᎦ, ᎾᏍᎩ ᏥᎥᎡᎸᎯ ᏂᎯ ᎨᏒ ᏅᏓᏳᎵᏍᏙᏔᏅᎩ ᏥᎥᎡᎸᎩ ᎦᎶᏁᏛ ᎠᎦᏔᎲᎢ;

source: So that Satan may not get the better of us: for we are not without knowledge of his designs.
chr: ᎾᏍᎩ ᎠᏍᎩᎾ ᎢᎩᎶᏄᎮᏗᏱ ᏂᎨᏒᎾ; ᎥᏝᏰᏃ ᏱᎩᎪᏁᎸ ᎾᏍᎩ ᎠᏓᏅᏖᎵᏙᎲᎢ.

source: Now when I came to Troas for the good news of Christ, and there was an open door for me in the Lord,
chr: ᎠᎴᏬ ᏠᎠᏏ ᏗᎩᎷᏨ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎶᏁᏛ ᎤᏤᎵ ᎠᏆᎵᏥᏙᏂᎸ, ᎠᎴ ᎦᎶᎯᏍᏗᏱ ᎠᎩᏍᏚᎩᎡᎸ ᎤᎬᏫᏳᎯ,

source: I had no rest in my spirit because Titus my brother was not there: so I went away from them, and came into Macedonia.
chr: ᎥᏝ ᏙᎯ ᎬᏆᏓᏅᏓᏗᏍᏗ ᏱᎨᏎ ᏗᏆᏓᏅᏛᎢ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᏓᏓᏏ ᎥᎩᏅᏟ ᏂᏥᏩᏛᎲᎾ ᎨᏒᎢ; ᎥᎦᏥᏴᏕᏨᎩᏃ ᎾᎿ ᎠᏆᏂᎩᏒᎩ ᎹᏏᏙᏂ ᏩᎩᎷᏨᎩ.

source: But praise be to God who makes us strong to overcome in Christ, and makes clear through us in every place the value of the knowledge of him.
chr: ᎾᏍᎩᏃ ᎠᎵᎮᎵᏤᏗ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᏂᎪᎯᎸ ᎢᎦᎵᎮᎵᏍᏗᏱ ᏥᏂᎬᏁᎭ ᎢᎦᏓᎵᏁᎯᏛ ᎤᎬᏩᎵ ᎦᎶᏁᏛ ᎡᏓᎵᏍᎦᏍᏙᏛᎢ, ᎠᎴ ᎬᏂᎨᏒ ᏥᏂᎬᏁᎭ ᎦᏩᏒᎬ ᎤᏩᏒ ᎠᏥᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎠᏴ ᎢᎬᏗᏍᎬ ᏂᎦᎥ ᏕᎨᏌᏗᏒᎢ.

source: For we are a sweet perfume of Christ to God in those who are getting salvation and in those who are going to destruction;
chr: ᎠᏴᏰᏃ ᎤᎦᎾᏍᏛ ᎦᏩᏒᎩ ᎤᏁᎳᏅᎯ ᎤᏪᏩᏒᎢᏍᏗ ᏃᏣᎵᏍᏗᎭ ᎦᎶᏁᏛ ᎤᏤᎵᎦ, ᎾᏍᎩ ᎨᏥᏍᏕᎸᏗ ᏥᎩ, ᎠᎴ ᎾᏍᎩ ᏧᏂᏲᎱᎯᏍᏗ ᏥᎩ.

source: To the one it is a perfume of death to death; to the other a perfume of life to life. And who is enough for such things?
chr: ᎾᏍᎩ ᏑᎾᏓᎴᎩ ᎨᏒ ᎠᏓᎯᎯ ᎦᏩᏒᎩ ᎾᏍᎩ ᎤᏂᎯᎯ ᏂᏙᏣᎵᏍᏓᏁᎭ; ᎠᏂᏐᎢᏃ ᎠᏓᏛᏂᏗᏍᎩ ᎦᏩᏒᎩ ᎾᏍᎩ ᎤᏅᏂᏗᏍᎩ ᏂᏙᏣᎵᏍᏓᏁᎭ. ᎦᎪᏃ ᏰᎵ ᎦᏰᎦᎨᏅᏗᏍᏗ ᎯᎠ ᎾᏍᎩ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ.

source: For we are not like the great number who make use of the word of God for profit: but our words are true, as from God, being said as before God in Christ.
chr: ᎥᏣᏰᏃ ᏧᏂᏣᏔᏉ ᏥᏄᎾᏍᏗ ᏱᏃᎦᏍᏗ, ᎾᏍᎩ ᎠᏂᏲᏍᏗᏍᎩ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ; ᏃᎦᏠᎾᏍᏛᎾᏍᎩᏂ ᎨᏒ ᏦᏨᏗᏍᎪᎢ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᏥᏂᎬᏂᏏᏍᎪ ᎾᏍᎩᏯᎢ, ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲ ᎣᏥᏁᎢᏍᏗ ᎦᎶᏁᏛ.

source: Do we seem to be again attempting to put ourselves in the right? or have we need, as some have, of letters of approval to you or from you?
chr: ᏥᎪ ᏔᎵᏁ ᎣᏣᎴᏂ ᎣᎬᏒ ᎣᏣᏓᎸᏉᏗᎭ? ᏥᎪᎨ ᎠᏎ ᏫᏗᏨᏃᎮᏗ ᏃᎦᎵᏍᏓᏁᎭ, ᎪᏪᎵ ᎣᎩᎸᏉᏗᏍᎩ ᎩᎶ ᏥᏄᎾᎵᏍᏓᏁᎰᎢ, ᎠᎴ ᏂᎯ ᏗᏍᎩᏅᏁᎸᎯ ᏍᎩᎸᏉᏗᏍᎩ?

source: You yourselves are our letter, whose writing is in our heart, open for every man's reading and knowledge;
chr: ᏂᎯ ᎪᏪᎵ ᎣᎦᏤᎵᎦ, ᏥᎪᏪᎳ ᏦᎩᎾᏫᎯ, ᎾᏂᎥ ᏴᏫ ᏣᏂᎦᏔᎭ ᎠᎴ ᏣᏂᎪᎵᏰᎠ.

source: For you are clearly a letter of Christ, the fruit of our work, recorded not with ink, but with the Spirit of the living God; not in stone, but in hearts of flesh.
chr: ᎬᏂᎨᏒᎢᏳ ᎢᏰᏨᏁᎸᎯ ᏂᎯ ᎦᎶᏁᏛ ᎤᏤᎵ ᎪᏪᎵ ᎨᏒᎢ, ᎠᏴ ᏦᎩᎸᏫᏍᏓᏁᎸᎯ, ᎪᏪᎳᏅᎯ ᎪᏪᎶᏗ ᎬᏔᏅᎯ ᏂᎨᏒᎾ, ᎠᏓᏅᏙᏍᎩᏂ ᎤᏁᎳᏅᎯ ᎬᏂᏛ ᎤᏤᎵ ᎬᏔᏅᎯ; ᎥᏝ ᏅᏲᎯ ᏗᎪᏪᎶᏗᏱ ᏗᎪᏪᎳᏅᎯ ᏱᎩ, ᎤᏇᏓᎵᏍᎩᏂ ᎨᏒ ᏗᎪᏪᎶᏗᏱ ᎣᎾᏫᏱ.

source: And this is the certain faith which we have in God through Christ:
chr: ᎾᏍᎩᏃ ᏄᏍᏗ ᏱᏣᎵᏍᎦᏍᏙᏛ ᎤᏁᎳᏅᎯ ᎦᎶᏁᏛ ᎢᏳᏩᏂᏌᏛ.

source: Not as if we were able by ourselves to do anything for which we might take the credit; but our power comes from God;
chr: ᎥᏝᏍᎩᏂᏃᏅ ᎣᎬᏒ ᎨᏒ ᏰᎵ ᎦᏲᎦᏓᏅᏖᏗ ᏱᎩ ᎪᎱᏍᏗ ᎣᎬᏒᏉ ᎨᏒ ᏅᏛᏓᎴᎲᏍᎩ, ᏰᎵᏉᏍᎩᏂ ᎢᎦᏲᎦᏛᏁᏗ ᎨᏒ ᎤᏁᎳᏅᎯᏱ ᏗᏓᎴᎲᏍᎦ.

source: Who has made us able to be servants of a new agreement; not of the letter, but of the Spirit: for the letter gives death, but the Spirit gives life.
chr: ᎾᏍᎩ ᎾᏍᏉ ᏰᎵ ᎢᎦᏲᎦᏛᏁᏗ ᏥᏃᎬᏁᎸ ᏦᎩᎸᏫᏍᏓᏁᏗᏱ ᎾᎿ ᎢᏤ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ; ᎥᏝ ᎠᏗᎾ ᏄᏍᏛ ᎪᏪᎸᎢ, ᎠᏓᏅᏙᏍᎩᏂ ᏓᏕᏲᎲᏍᎬᎢ; ᏄᏍᏛᏰᏃ ᎪᏪᎸ ᎠᏓᎯᎰᏉ, ᎠᏓᏅᏙᏍᎩᏂ ᎠᏓᏛᏂᏗᏍᎪᎢ.

source: For if the operation of the law, giving death, recorded in letters on stone, came with glory, so that the eyes of the children of Israel had to be turned away from the face of Moses because of its glory, a glory which was only for a time:
chr: ᎢᏳᏃ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎠᏓᎯᎯ ᎨᏒ ᎤᎬᏩᎵ ᏥᎪᏪᎴ ᏣᏰᎶᎴ ᏅᏲᎯ ᎦᎸᏉᏗᏳ ᏥᎨᏎᎢ, ᎾᏍᎩ ᎢᏏᎵ ᏧᏪᏥ ᎪᎯᏛ ᏗᎬᏩᎾᎧᏃᏗ ᏂᎨᏒᎾ ᏥᎨᏎ ᎼᏏ ᎤᎧᏛᎢ, ᏥᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏗᎬᏩᎸᏌᏛ ᎨᏒ ᎤᎧᏛᎢ; ᎾᏍᎩ ᎠᎲᏍᏗᏉ ᏥᎨᏎᎢ;

source: Will not the operation of the Spirit have a much greater glory?
chr: ᏝᏍᎪ Ꮀ ᏳᎬᏫᏳᏎᏍᏗ ᎦᎸᏉᏗᏳ ᏱᎨᏎᏍᏗ ᎠᏓᏅᏙ ᎤᎬᏩᎵ ᎨᏒ ᏗᎦᎸᏫᏍᏓᏁᏗ?

source: For if the operation of the law, producing punishment, had its glory, how much greater will be the operation of the Spirit causing righteousness?
chr: ᎢᏳᏰᏃ ᏗᎦᎸᏫᏍᏓᏁᏗ ᏗᏓᏚᎪᏓᏁᎯ ᎨᏒ ᎦᎾᏄᏫᏍᎩ ᎦᎸᏉᏗᏳ ᏱᎩ, Ꮀ ᎤᎬᏫᏳᎭ ᎤᏓᎪᎾᏛᏗ ᎦᎸᏉᏗᏳ ᎠᏓᏚᏓᎴᏍᎩ ᎨᏒ ᏗᎦᎸᏫᏍᏓᏁᏗ.

source: For the glory of the first no longer seems to be glory, because of the greater glory of that which comes after.
chr: ᎾᏍᎩᏰᏃ ᎾᏍᏉ ᎦᎸᏉᏗᏳ ᎢᎬᏁᎸᎯ ᏥᎨᏎ ᎥᏝ ᎰᏩ ᎦᎸᏉᏗᏳ ᏱᎨᏎᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎬᏩᏓᎪᎾᏛᏛ ᎦᎸᏉᏗᏳ ᎨᏒ ᏐᎢ.

source: For if the order which was for a time had its glory, much more will the eternal order have its glory.
chr: ᎢᏳᏰᏃ ᎾᏍᎩ Ꮎ ᎠᎲᏛ ᏥᎩ ᎦᎸᏉᏗᏳ ᏱᎨᏎᎢ, ᎤᏟᎯᏳ ᏭᏓᎪᎾᏛᏗ ᎦᎸᏉᏗᏳ ᎾᏍᎩ Ꮎ ᏥᏅᏩᏍᏗᏉ.

source: Having then such a hope, we keep nothing back,
chr: ᎾᏍᎩᏃ Ꮎ ᏥᏄᏍᏗ ᎤᏚᎩ ᏦᎬᎭ, ᎤᏣᏘ ᎠᎯᏗᏳ ᎦᎪᎵᏍᏗ ᎣᏥᏬᏂᎭ;

source: And are not like Moses, who put a veil on his face, so that the children of Israel might not see clearly to the end of the present order of things:
chr: ᎢᏝᏃ ᎼᏏ ᏥᏄᏛᏁᎴ [ᏱᏃᏣᏛᏁᎭ] ᏧᎵᎬᏚᎳᏁ ᎾᏍᎩ ᎢᏏᎵ ᏧᏪᏥ ᏫᏗᎬᏩᎾᎧᏃᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ ᏩᏍᏛ ᎾᏍᎩ Ꮎ ᎠᎲᏛ ᏥᎩ.

source: But their minds were made hard: for to this very day at the reading of the old agreement the same veil is still unlifted; though it is taken away in Christ.
chr: ᏚᎾᏓᏅᏛᏍᎩᏂ ᏧᏍᎦᏃᎵᏳ ᎨᏎᎢ; ᎪᎯᏰᏃ ᎢᏯᏍᏗ ᏅᏩᏍᏗᏉ ᎾᏍᎩ Ꮎ ᎠᎵᎬᏚᎶ ᎠᎲᏛ ᏂᎨᏒᎾ ᎢᏳᏃ ᏓᏂᎪᎵᏯ ᎤᏪᏘ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛ ᎪᏪᎸᎢ; ᎦᎶᏁᏛᏰᏃ ᏂᎬᏂᏏᏍᎪ ᎠᎲᏛ ᏂᎨᏐᎢ.

source: But to this day, at the reading of the law of Moses, a veil is over their heart.
chr: ᎩᎳᎯᏳᏉᏍᎩᏂ ᎪᎯ ᎢᎦ ᎢᏯᏍᏗ ᎢᏳᏃ ᎼᏏ ᏓᏥᎪᎵᏯ ᎠᎵᎬᏚᎶ ᏧᏂᎾᏫ ᏚᏭᏢᏙᎢ.

source: But when it is turned to the Lord, the veil will be taken away.
chr: ᎠᏎᏍᎩᏂᏃᏅ, ᎤᎬᏫᏳᎯᏱ ᏫᏓᎦᏔᎲᏍᏔᏅᎭ, ᎾᏍᎩ Ꮎ ᎠᎵᎬᏚᎶ ᎢᏴᏛ ᎢᎬᏁᏗ ᏅᏓᎦᎵᏍᏔᏂ.

source: Now the Lord is the Spirit: and where the Spirit of the Lord is, there the heart is free.
chr: ᎠᎴ ᎤᎬᏫᏳᎯ ᎾᏍᎩ Ꮎ ᎠᏓᏅᏙ; ᎢᎸᎯᏢᏃ ᏄᏛᎿᏕᎬ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᎠᏓᏅᏙ, ᎾᎿ ᎡᎭ ᎣᏩᏒ ᎣᏓᏤᎵᎦᏯ ᎨᏒᎢ.

source: But we all, with unveiled face giving back as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as from the Lord who is the Spirit.
chr: ᎠᏴᏍᎩᏂ ᏂᏗᎥ ᏂᏗᎦᎵᎬᏚᎸᎾ ᎠᏓᎨᏗᏱ ᎾᏍᎩᏯ ᏕᏓᎧᏂᏍᎬ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᎬᏫᏳᎯ ᎤᏤᎵᎦ, ᎢᏓᏓᏁᏟᏴᎭ ᎾᏍᎩᏯ ᏄᏍᏛ ᏂᏓᎵᏍᏗᎭ, ᎦᎸᏉᏗᏳ ᎨᏒ ᎢᎩᎲ ᎧᏁᏉᏤᎦ, ᎤᎬᏫᏳᎯ ᎤᏓᏅᏙ ᎢᏳᏩᏂᏌᏛ ᎾᏍᎩᏯᎢ.

source: For this reason, because we have been made servants of this new order, through the mercy given to us, we are strong:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎾᏍᎩ ᎯᎠ ᏗᎦᎸᏫᏍᏓᏁᏗ ᏦᎩᎭ, ᎾᏍᎩᏯ ᎣᎩᏙᎵᏨᎢ, ᎥᏝ ᏱᏙᎩᏯᏪᎦ;

source: And we have given up the secret things of shame, not walking in false ways, and not making use of the word of God with deceit; but by the revelation of what is true, as before God, we have the approval of every man's sense of right and wrong.
chr: ᏙᎩᏲᏒᏍᎩᏂ ᏧᏓᎴᏅᏛ ᎬᏍᎦᎵ ᎤᏕᎰᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎥᏝ ᏲᏤᏙᎭ ᎠᏏᎾᏌᏅᎢᏍᏗ ᎨᏒᎢ, ᎥᏝ ᎠᎴ ᎣᎦᏠᎾᏍᏛ ᏱᏙᎩᎸᏫᏍᏓᏁᎭ ᎧᏃᎮᏛ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎬᏂᎨᏒᏍᎩᏂ ᏃᏨᏁᎲ ᎦᏰᎪᎩ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎪᎩᎸᏉᏙᏗᏱ ᏃᏨᏁᎭ ᎾᏂᎥ ᏴᏫ ᏚᎾᏓᏅᏛ ᎬᏗ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ.

source: But if our good news is veiled, it is veiled from those who are on the way to destruction:
chr: ᎢᏳᏍᎩᏂ ᎣᏍᏛ ᎧᏃᎮᏛ ᎣᎦᏤᎵ ᎾᏍᏉ ᎬᏍᎦᎵ ᎢᎨᏎᏍᏗ, ᎾᏍᎩ Ꮎ ᎨᏥᏛᏙᏗ ᎨᏒ ᎨᎬᏍᎦᎳᏁᎸ.

source: Because the god of this world has made blind the minds of those who have not faith, so that the light of the good news of the glory of Christ, who is the image of God, might not be shining on them.
chr: ᎾᏍᎩ Ꮎ ᎾᏃᎯᏳᎲᏍᎬᎾ ᎾᏍᎩ ᎯᎠ ᎡᎶᎯ ᎤᏁᎳᏅᎯ ᎤᏰᎸᎯ ᏚᎵᏏᎲᏍᏓᏁᎸ ᏚᎾᏓᏅᏛᎢ, ᎾᏍᎩ ᏧᏂᎸᏌᏓᏕᏗᏱ ᏂᎨᏒᎾ ᎢᎦ-ᎦᏛ ᎤᏘᏍᏛ ᎦᎸᏉᏗᏳ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎶᏁᏛ ᎤᏤᎵᎦ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎾᏍᎩᏯ ᏥᎩ.

source: For our preaching is not about ourselves, but about Christ Jesus as Lord, and ourselves as your servants through Jesus.
chr: ᎥᏝᏰᏃ ᎣᎬᏒ ᏲᏣᏓᏃᎮᎭ ᎣᏣᎵᏥᏙᎲᏍᎬᎢ, ᎦᎶᏁᏛᏍᎩᏂ ᏥᏌ ᎤᎬᏫᏳᎯ; ᎠᏴᏃ ᏂᎯ ᎣᎩᏅᏏᏓᏍᏗ ᎨᏒ ᎾᏍᎩ ᏥᏌ ᏅᏗᎦᎵᏍᏙᏗᏍᎬᎢ.

source: Seeing that it is God who said, Let light be shining out of the dark, who has put in our hearts the light of the knowledge of the glory of God in the face of Jesus Christ.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎾᏍᎩ Ꮎ ᏧᏁᏤ ᎢᎦᎦᏘ ᎤᎵᏏᎬ ᏧᎸᏌᏓᏗᏍᏗᏱ, ᏚᎸᏌᏓᏗᎸ ᏦᎩᎾᏫᏱ, ᎾᏍᎩ ᎣᎩᏁᏗᏱ ᎢᎦ-ᎦᏘ ᎠᎦᏙᎥᎯᏍᏙᏗ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎾᏍᎩ ᏥᏌ ᎦᎶᏁᏛ ᎤᎧᏛ ᏨᏗᏓᎴᎲᏍᎦ.

source: But we have this wealth in vessels of earth, so that it may be seen that the power comes not from us but from God;
chr: ᎠᏎᏃ ᎯᎠ ᎾᏍᎩ ᏧᎬᏩᎶᏗ ᎦᏓᏉ ᏗᎪᏢᏔᏅᎯ ᏕᎩᎶᏗ, ᎾᏍᎩ ᎤᏣᏘ ᎤᎵᏂᎩᏛ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ, ᎥᏝᏃ ᎠᏴ.

source: Troubles are round us on every side, but we are not shut in; things are hard for us, but we see a way out of them;
chr: ᎣᎦᏕᏯᏙᏗᎭ ᎬᏩᏚᏫᏛᏉ, ᎠᏎᏃ ᎥᏝ ᏲᎩᎩᎸᏍᎦ; ᎤᏪᎵᎯᏍᏗ ᎣᎦᏓᏅᏔᏩᏕᎦ, ᎠᏎᏃ ᎥᏝ ᎣᎦᎵᎲᏲᎵᎸᎯ ᏱᎩ;

source: We are cruelly attacked, but not without hope; we are made low, but we are not without help;
chr: ᎤᏲ ᏃᎬᎾᏕᎪᎢ, ᎠᏎᏃ ᎥᏝ ᎣᎬᏕᏨᎯ ᏱᎩ; ᏙᎩᏍᏢᏂᏍᏔᏅ, ᎠᏎᏃ ᎥᏝ ᎣᎩᏛᏔᏅᎯ ᏱᎩ.

source: In our bodies there is ever the mark of the death of Jesus, so that the life of Jesus may be seen in our bodies.
chr: ᏂᎪᎯᎸ ᏦᏥᏰᎸ ᎣᏥᏱᏙᎰ ᎤᏲᎱᏒ ᎤᎬᏫᏳᎯ ᏥᏌ, ᎾᏍᎩ ᎾᏍᏉ ᎬᏅ ᏥᏌ ᎬᏂᎨᏒ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏴ ᏦᏥᏰᎸᎢ.

source: For, while living, we are still being given up to death because of Jesus, so that the life of Jesus may be seen in our flesh, though it is under the power of death.
chr: ᎠᏴᏰᏃ ᏦᏤᎭ ᏂᎪᎯᎸᏉ ᏦᎩᏲᎱᏏᏕᎾ ᏥᏌ ᎣᎩᏍᏛᏗᏍᎬᎢ, ᎾᏍᎩ ᎬᏅ ᎾᏍᏉ ᏥᏌ ᎬᏂᎨᏒ ᎢᏳᎵᏍᏙᏗᏱ ᎠᏴ ᎠᏲᎱᏍᎩ ᎣᎩᏇᏓᎸᎢ.

source: So then, death is working in us, but life in you.
chr: ᎾᏍᎩᏃ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎣᎩᏱᎵᏙᎭ ᎠᏴ, ᏂᎯᏍᎩᏂ ᎬᏂᏛ.

source: But having the same spirit of faith, as it is said in the Writings, The words of my mouth came from the faith in my heart; in the same way, our words are the outcome of our faith;
chr: ᎤᏠᏱᏉ ᏦᎩᎭ ᎠᏓᏅᏙ ᎪᎯᏳᏙᏗ ᎨᏒᎢ, ᎯᎠ ᎾᏍᎩᏯ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᎠᏉᎯᏳᏅ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᎩᏁᏨ; ᎠᏴ ᎾᏍᏉ ᎣᏦᎯᏳᎲᏍᎦ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏍᏗ ᎣᏥᏁᎦ.

source: Because we are certain that he who made the Lord Jesus come back from the dead, will do the same for us, and will give us a place in his glory with you.
chr: ᎣᏥᎦᏔᎭᏰᏃ ᎾᏍᎩ Ꮎ ᎤᎬᏫᏳᎯ ᏥᏌ ᏧᎴᏔᏅᎯ, ᎾᏍᏉ ᎠᏴ ᏥᏌ ᎠᎬᏗᏍᎬ ᏙᏓᏲᎦᎴᏔᏂ, ᎠᎴ ᎠᏴ ᏂᎯᏃ ᎢᏧᎳᎭ ᏫᏗᎩᏲᏏᎯᏍᏗ ᎨᏎᏍᏗ.

source: For we go through all things on account of you, because the greater the number to whom the grace is given, the greater is the praise to the glory of God.
chr: ᏂᎦᏗᏳᏰᏃ ᏧᏓᎴᏅᏛ ᏤᎭ ᏂᎯ ᏅᏗᎦᎵᏍᏙᏗᎭ; ᎾᏍᎩ ᎤᏣᏘ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᏳᏩᏂᏐᏗᏱ ᎤᏁᎳᏅᎯ ᎤᏣᏘ ᎦᎸᏉᏙᏗ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏂᏣᏘ ᎠᎾᎵᎮᎵᎬᎢ.

source: For which cause we do not give way to weariness; but though our outer man is getting feebler, our inner man is made new day by day.
chr: ᎾᏍᎩ ᏅᏗᎦᎵᏍᏙᏗᎭ ᎥᏝ ᏱᏙᎩᏯᏪᎦ; ᎤᏙᎯᏳᎯᏍᎩᏂᏃᏅ ᎦᏚᎢᏗᏢ ᎡᎯ ᎨᏒ ᎣᎩᏩᎾᎦᎶᏤᎭ, ᎭᏫᏂᏗᏢᏍᎩᏂ ᎡᎯ ᎨᏒ ᎣᎦᎵᏂᎪᎯᏎᎭ ᏂᏓᏙᏓᏈᏒᎢ.

source: For our present trouble, which is only for a short time, is working out for us a much greater weight of glory;
chr: ᎤᏓᏌᎧᏰᏃ ᎣᏥᎩᎵᏲᎬ ᏞᎦᏉ ᏥᎩ ᎣᎩᏩᏛᎡᎭ ᎤᏣᏘ ᎤᎶᏒᏍᏔᏅᎯ ᎢᏳᏓᎨᏛ ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᎦᎸᏉᏗᏳ ᎨᏒᎢ;

source: While our minds are not on the things which are seen, but on the things which are not seen: for the things which are seen are for a time; but the things which are not seen are eternal.
chr: ᏂᏙᏣᎧᏂᏍᎬᎾ ᎨᏒ ᎾᏍᎩ ᏗᎬᎪᏩᏛᏗ ᏥᎩ, ᎾᏍᎩᏍᎩᏂ Ꮎ ᏗᎬᎪᏩᏛᏗ ᏂᎨᏒᎾ ᏥᎩ; ᎾᏍᎩᏰᏃ ᏗᎬᎪᏩᏛᏗ ᏥᎩ ᏗᎦᎶᏐᎲᏍᎩ; ᎾᏍᎩᏍᎩᏂ Ꮎ ᏗᎬᎪᏩᏛᏗ ᏂᎨᏒᎾ ᏥᎩ ᏗᎦᎶᏐᎲᏍᎩ ᏂᎨᏒᎾ.

source: For we are conscious that if this our tent of flesh is taken down, we have a building from God, a house not made with hands, eternal, in heaven.
chr: ᎣᏥᎦᏔᎭᏰᏃ ᎾᏍᎩ ᎢᏳᏃ ᎡᎶᎯ ᎡᎯ ᎣᏥᏁᎸ ᎣᎩᎵᏦᏛ ᏳᏲᏨ, ᎣᎩᎭ ᎠᏓᏁᎸ ᎤᏁᎳᏅᎯ ᏅᏓᏳᏓᎴᏅᎯ, ᎠᏓᏁᎸ ᏧᏬᏱ ᏗᎬᏔᏅᎯ ᏂᎨᏒᎾ ᎠᏁᏍᎨᎲᎯ, ᎠᏲᎩ ᏂᎨᏒᎾ ᎦᎸᎶᎢ ᏗᏓᏁᎸ.

source: For in this we are crying in weariness, greatly desiring to be clothed with our house from heaven:
chr: ᎠᏂᏰᏃ ᎣᏥᏯᎥ ᎣᎩᎵᏰᏗᎭ, ᎤᏣᏘ ᎣᎦᏚᎵᎭ ᎣᎦᏄᏬᏍᏙᏗᏱ ᎣᏥᏁᎸ ᎾᏍᎩ Ꮎ ᎦᎸᎶ ᏅᏓᏳᏓᎴᏅᎯ;

source: So that our spirits may not be unclothed.
chr: ᎢᏳᏃ ᎰᏩ ᏱᏙᎦᏄᏩᎥ, ᎥᏝ ᏦᎩᏰᎸᎭ ᏱᎦᎨᏎᏍᏗ.
